In [1]:
import numpy as np
import pandas as pd

In [3]:
# A Series is a one dimensional DataFrame 
data = np.array ([85, 90, 70, 80])
series = pd.Series(data=data, name="marks")

print(series)

0    85
1    90
2    70
3    80
Name: marks, dtype: int64

In [4]:
# This is a Series with a one-dimesnional data values and Index
data = np.array([[25, 85],
                 [25, 90],
                 [26, 70],
                 [24, 80]])
dataframe = pd.DataFrame(data=data, columns=["age", "marks"])
print(dataframe)

   age  marks
0   25     85
1   25     90
2   26     70
3   24     80

# Method 1: Selecting a single column using the column name

In [5]:
# Load some data
import pandas as pd
from sklearn.datasets import load_wine
wine = load_wine()
df = pd.DataFrame(data=wine.data,
                  columns=wine.feature_names)
# Select the 'alcohol column'
print(df['alcohol'])
print(type(df['alcohol']))

0      14.23
1      13.20
2      13.16
3      14.37
4      13.24
       ...
173    13.71
174    13.40
175    13.27
176    13.17
177    14.13
Name: alcohol, Length: 178, dtype: float64
<class 'pandas.core.series.Series'>

# Method 2: Selecting multiple columns using the column names

In [6]:
df[['alcohol', 'ash', 'hue']]

     alcohol   ash   hue
0      14.23  2.43  1.04
1      13.20  2.14  1.05
2      13.16  2.67  1.03
3      14.37  2.50  0.86
4      13.24  2.87  1.04
..       ...   ...   ...
173    13.71  2.45  0.64
174    13.40  2.48  0.70
175    13.27  2.26  0.59
176    13.17  2.37  0.60
177    14.13  2.74  0.61

[178 rows x 3 columns]

# Method 3: Selecting a single column using the .loc attribute

In [8]:
df.loc[:, 'alcohol']

0      14.23
1      13.20
2      13.16
3      14.37
4      13.24
       ...
173    13.71
174    13.40
175    13.27
176    13.17
177    14.13
Name: alcohol, Length: 178, dtype: float64

# Method 4: Selecting multiple columns using the .loc attribute

In [9]:
df.loc[:, ['alcohol', 'ash', 'hue']]

     alcohol   ash   hue
0      14.23  2.43  1.04
1      13.20  2.14  1.05
2      13.16  2.67  1.03
3      14.37  2.50  0.86
4      13.24  2.87  1.04
..       ...   ...   ...
173    13.71  2.45  0.64
174    13.40  2.48  0.70
175    13.27  2.26  0.59
176    13.17  2.37  0.60
177    14.13  2.74  0.61

[178 rows x 3 columns]

In [11]:
# If there are multiple labels, they should be specified inside lists:

df.loc[['row_1', 'row_2'], 
       ['column_1', 'column_2']]

# Method 5: Selecting a single column using the .iloc attribute

In [12]:
df.iloc[:, 0]

0      14.23
1      13.20
2      13.16
3      14.37
4      13.24
       ...
173    13.71
174    13.40
175    13.27
176    13.17
177    14.13
Name: alcohol, Length: 178, dtype: float64

# Method 6: Selecting multiple columns using the .iloc attribute

In [13]:
df.iloc[:, [0, 2, 10]]

     alcohol   ash   hue
0      14.23  2.43  1.04
1      13.20  2.14  1.05
2      13.16  2.67  1.03
3      14.37  2.50  0.86
4      13.24  2.87  1.04
..       ...   ...   ...
173    13.71  2.45  0.64
174    13.40  2.48  0.70
175    13.27  2.26  0.59
176    13.17  2.37  0.60
177    14.13  2.74  0.61

[178 rows x 3 columns]

In [ ]:
# If there are multiple labels, they should be specified inside lists:

df.iloc[['row_index_1', 'row_index_2'], 
       ['column_index_1', 'column_index_2']]

# Method 7: Selecting consecutive columns using the .iloc attribute (The easy way)

In [14]:
df.iloc[:, [0, 1, 2, 3, 4]]

     alcohol  malic_acid   ash  alcalinity_of_ash  magnesium
0      14.23        1.71  2.43               15.6      127.0
1      13.20        1.78  2.14               11.2      100.0
2      13.16        2.36  2.67               18.6      101.0
3      14.37        1.95  2.50               16.8      113.0
4      13.24        2.59  2.87               21.0      118.0
..       ...         ...   ...                ...        ...
173    13.71        5.65  2.45               20.5       95.0
174    13.40        3.91  2.48               23.0      102.0
175    13.27        4.28  2.26               20.0      120.0
176    13.17        2.59  2.37               20.0      120.0
177    14.13        4.10  2.74               24.5       96.0

[178 rows x 5 columns]

In [15]:
# We can also use the following easy method to obtain the same result.

df.iloc[:, 0:5]

     alcohol  malic_acid   ash  alcalinity_of_ash  magnesium
0      14.23        1.71  2.43               15.6      127.0
1      13.20        1.78  2.14               11.2      100.0
2      13.16        2.36  2.67               18.6      101.0
3      14.37        1.95  2.50               16.8      113.0
4      13.24        2.59  2.87               21.0      118.0
..       ...         ...   ...                ...        ...
173    13.71        5.65  2.45               20.5       95.0
174    13.40        3.91  2.48               23.0      102.0
175    13.27        4.28  2.26               20.0      120.0
176    13.17        2.59  2.37               20.0      120.0
177    14.13        4.10  2.74               24.5       96.0

[178 rows x 5 columns]

# Method 8: Selecting the last column

In [16]:
# We can count the number of columns in the data frame using the .shape attribute 

df.shape

(178, 13)

In [17]:
# the last columns is the 13th one that can be accessed through index 12. By using .iloc

df.iloc[:, 12]

0      1065.0
1      1050.0
2      1185.0
3      1480.0
4       735.0
        ...
173     740.0
174     750.0
175     835.0
176     840.0
177     560.0
Name: proline, Length: 178, dtype: float64

In [19]:
# The second method is much easy. Here, we do not need to know the number of columns in the data frame.

df.iloc[:, -1]

0      1065.0
1      1050.0
2      1185.0
3      1480.0
4       735.0
        ...
173     740.0
174     750.0
175     835.0
176     840.0
177     560.0
Name: proline, Length: 178, dtype: float64

# Slicing

# Method 9: Selecting a single row using the .iloc attribute

In [20]:
# The easiest way to extract a single row is to use the row index inside the .iloc attribute. 
# The general syntax is:

#df.iloc[row_index]

df.iloc[0]

alcohol                           14.23
malic_acid                         1.71
ash                                2.43
alcalinity_of_ash                 15.60
magnesium                        127.00
total_phenols                      2.80
flavanoids                         3.06
nonflavanoid_phenols               0.28
proanthocyanins                    2.29
color_intensity                    5.64
hue                                1.04
od280/od315_of_diluted_wines       3.92
proline                         1065.00
Name: 0, dtype: float64

In [21]:
# The appearance is a bit confusing as the output is a Pandas Series. 
# If you want this as a row itself, simply use the index values inside a list as follows:

df.iloc[[0]]

,alcohol,malic_acid,ash,alcalinity_of_ash,magnesium,total_phenols,flavanoids,nonflavanoid_phenols,proanthocyanins,color_intensity,hue,od280/od315_of_diluted_wines,proline
0,14.23,1.71,2.43,15.6,127.0,2.8,3.06,0.28,2.29,5.64,1.04,3.92,1065.0

# Method 10: Selecting multiple rows using the .iloc attribute

In [23]:
#We can extract multiple rows of a Pandas DataFrame using its row indices. We include row indices inside a list:
# using double brackets


df.iloc[[0, 25, 100]]

,alcohol,malic_acid,ash,alcalinity_of_ash,magnesium,total_phenols,flavanoids,nonflavanoid_phenols,proanthocyanins,color_intensity,hue,od280/od315_of_diluted_wines,proline
0,14.23,1.71,2.43,15.6,127.0,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065.0
25,13.05,2.05,3.22,25.0,124.0,2.63,2.68,0.47,1.92,3.58,1.13,3.20,830.0
100,12.08,2.08,1.70,17.5,97.0,2.23,2.17,0.26,1.40,3.30,1.27,2.96,710.0

# Method 11: Selecting the last few rows

In [24]:
df.iloc[[-1,-2,-3,-4,-5]]

,alcohol,malic_acid,ash,alcalinity_of_ash,magnesium,total_phenols,flavanoids,nonflavanoid_phenols,proanthocyanins,color_intensity,hue,od280/od315_of_diluted_wines,proline
177,14.13,4.10,2.74,24.5,96.0,2.05,0.76,0.56,1.35,9.2,0.61,1.60,560.0
176,13.17,2.59,2.37,20.0,120.0,1.65,0.68,0.53,1.46,9.3,0.60,1.62,840.0
175,13.27,4.28,2.26,20.0,120.0,1.59,0.69,0.43,1.35,10.2,0.59,1.56,835.0
174,13.40,3.91,2.48,23.0,102.0,1.80,0.75,0.43,1.41,7.3,0.70,1.56,750.0
173,13.71,5.65,2.45,20.5,95.0,1.68,0.61,0.52,1.06,7.7,0.64,1.74,740.0

# Indexing

# Method 12: Selecting a single value using the .iloc attribute

In [25]:
# If we specify a single row and a single column, the intersection is a single value!
df.iloc[0,0]

14.23

## Keep in mind that we cannot use column or row names inside .iloc[]. Only the index numbers can be used!

# Method 13: Selecting a single value using the .loc attribute

### df.iloc[[row_index_1, row_index_2, ...],
###        [column_index_1, column_index_2, ...]]

In [26]:
df.iloc[[0, 5, 100], [0, 3, 7]]

     alcohol  alcalinity_of_ash  nonflavanoid_phenols
0      14.23               15.6                  0.28
5      14.20               15.2                  0.34
100    12.08               17.5                  0.26

# Method 15: Selecting multiple rows and columns using the .loc attribute

In [27]:
df.loc[[0, 5, 100], ['alcohol', 'ash', 'hue']]

     alcohol   ash   hue
0      14.23  2.43  1.04
5      14.20  2.45  1.05
100    12.08  1.70  1.27

## Here we can use row or column names inside .loc[]. 
## Also keep in mind that, in our data, the row names are the same as the row indices

# Method 16: Selecting consecutive rows and columns using the .loc and .iloc attributes (The easy way)

In [28]:
df.iloc[0:6, 0:5]

   alcohol  malic_acid   ash  alcalinity_of_ash  magnesium
0    14.23        1.71  2.43               15.6      127.0
1    13.20        1.78  2.14               11.2      100.0
2    13.16        2.36  2.67               18.6      101.0
3    14.37        1.95  2.50               16.8      113.0
4    13.24        2.59  2.87               21.0      118.0
5    14.20        1.76  2.45               15.2      112.0

In [29]:
# OR
df.loc[0:6, ['alcohol', 'ash']]

   alcohol   ash
0    14.23  2.43
1    13.20  2.14
2    13.16  2.67
3    14.37  2.50
4    13.24  2.87
5    14.20  2.45
6    14.39  2.45

# Filtering

# Method 17: Filtering based on a single criterion with all columns

In [30]:
df['alcohol'] > 14.3

0      False
1      False
2      False
3       True
4      False
       ...
173    False
174    False
175    False
176    False
177    False
Name: alcohol, Length: 178, dtype: bool

In [31]:
# This is a Pandas Series of boolean data type. We can use this Series to get the required subset of the data.

df[df['alcohol'] > 14.3]

,alcohol,malic_acid,ash,alcalinity_of_ash,magnesium,total_phenols,flavanoids,nonflavanoid_phenols,proanthocyanins,color_intensity,hue,od280/od315_of_diluted_wines,proline
3,14.37,1.95,2.50,16.8,113.0,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480.0
6,14.39,1.87,2.45,14.6,96.0,2.50,2.52,0.30,1.98,5.25,1.02,3.58,1290.0
8,14.83,1.64,2.17,14.0,97.0,2.80,2.98,0.29,1.98,5.20,1.08,2.85,1045.0
13,14.75,1.73,2.39,11.4,91.0,3.10,3.69,0.43,2.81,5.40,1.25,2.73,1150.0
14,14.38,1.87,2.38,12.0,102.0,3.30,3.64,0.29,2.96,7.50,1.20,3.00,1547.0
46,14.38,3.59,2.28,16.0,102.0,3.25,3.17,0.27,2.19,4.90,1.04,3.44,1065.0
158,14.34,1.68,2.70,25.0,98.0,2.80,1.31,0.53,2.70,13.00,0.57,1.96,660.0

# Method 18: Filtering based on a single criterion with a few columns

In [32]:
df.loc[df['alcohol'] > 14.3, 
      ['alcohol', 'ash', 'hue']]

     alcohol   ash   hue
3      14.37  2.50  0.86
6      14.39  2.45  1.02
8      14.83  2.17  1.08
13     14.75  2.39  1.25
14     14.38  2.38  1.20
46     14.38  2.28  1.04
158    14.34  2.70  0.57

# Method 19: Filtering based on two criteria with AND operator (Same column)

In [33]:
df[(df['alcohol'] > 14.3) & (df['alcohol'] < 14.6)]

,alcohol,malic_acid,ash,alcalinity_of_ash,magnesium,total_phenols,flavanoids,nonflavanoid_phenols,proanthocyanins,color_intensity,hue,od280/od315_of_diluted_wines,proline
3,14.37,1.95,2.50,16.8,113.0,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480.0
6,14.39,1.87,2.45,14.6,96.0,2.50,2.52,0.30,1.98,5.25,1.02,3.58,1290.0
14,14.38,1.87,2.38,12.0,102.0,3.30,3.64,0.29,2.96,7.50,1.20,3.00,1547.0
46,14.38,3.59,2.28,16.0,102.0,3.25,3.17,0.27,2.19,4.90,1.04,3.44,1065.0
158,14.34,1.68,2.70,25.0,98.0,2.80,1.31,0.53,2.70,13.00,0.57,1.96,660.0

# Method 20: Filtering based on two criteria with the between() method

In [35]:
# A similar type of filtering discussed in Method 19 can be achieved using the between() method

df[df['alcohol'].between(14.3, 14.6)]

,alcohol,malic_acid,ash,alcalinity_of_ash,magnesium,total_phenols,flavanoids,nonflavanoid_phenols,proanthocyanins,color_intensity,hue,od280/od315_of_diluted_wines,proline
3,14.37,1.95,2.50,16.8,113.0,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480.0
6,14.39,1.87,2.45,14.6,96.0,2.50,2.52,0.30,1.98,5.25,1.02,3.58,1290.0
14,14.38,1.87,2.38,12.0,102.0,3.30,3.64,0.29,2.96,7.50,1.20,3.00,1547.0
16,14.30,1.92,2.72,20.0,120.0,2.80,3.14,0.33,1.97,6.20,1.07,2.65,1280.0
46,14.38,3.59,2.28,16.0,102.0,3.25,3.17,0.27,2.19,4.90,1.04,3.44,1065.0
158,14.34,1.68,2.70,25.0,98.0,2.80,1.31,0.53,2.70,13.00,0.57,1.96,660.0